app/views/pages/dashboard.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 9]]
---
    <h1>Borrowing</h1>
    <% if current_user.bookings.present? %>

SELECT "costumes".* FROM "costumes" WHERE "costumes"."user_id" = $1  [["user_id", 9]]
---
  <h1>Lending</h1>
    <% if current_user.costumes.present? %>

SELECT "bookings".* FROM "bookings" WHERE "bookings"."costume_id" = $1  [["costume_id", 18]]
---
          <h4><%= costume.name %>'s Bookings<h4>
          <% if costume.bookings.present? %>