app/controllers/costumes_controller.rb

SELECT "costumes".* FROM "costumes" WHERE (clothing ILIKE '%Suits%')
---
  def index
    @costumes = policy_scope(Costume)
    if params[:query].present?
      @costumes = Costume.supersearch(params[:query])
    else
      @costumes = Costume.all

SELECT "costumes".* FROM "costumes" WHERE "costumes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @booking = Booking.new
    @costume = Costume.find(params[:id])

INSERT INTO "costumes" ("name", "description", "price", "clothing", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @costume = Costume.new(costume_params)
    @costume.user = current_user
    authorize @costume
    if @costume.save

SELECT "costumes".* FROM "costumes" WHERE "costumes"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
  def edit
    @costume = Costume.find(params[:id])

SELECT "costumes".* FROM "costumes" WHERE "costumes"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "costumes" SET "updated_at" = $1 WHERE "costumes"."id" = $2  [["updated_at", "2023-11-13 05:29:14.802538"], ["id", 18]]
---
  def update
    @costume = Costume.find(params[:id])
    authorize @costume

    if @costume.update(costume_params)

SELECT "costumes".* FROM "costumes" WHERE "costumes"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "costumes" WHERE "costumes"."id" = $1  [["id", 16]]
---
  def destroy
    @costume = Costume.find(params[:id])
    authorize @costume
    @costume.destroy